Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་བརྟན་པའི་དབྱངས་ནི་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་འོད་ཟེར་ལ། །གོས་ཀྱི་བླ་རེ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dṛḍhasvara, when a captain, Offered a canopy of clothing To the thus-gone Radiant Nectar And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བདེ་ལྡན་སྨད་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩི་སེམས་པ་ལ། །ཤི་ཡི་བུར་མ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sukhita, when a prostitute, Offered meat balls To the thus-gone Nectar Intent And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དོན་གསུང་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚོགས་ཅན་རབ་མཆོག་ལ། །ཀ་ཤའི་གདན་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Arthavādin, when a merchant, Offered a seat made of kuśa To the thus-gone Supreme Possessor of Gatherings And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དགྱེས་གསལ་གྲོང་རྡལ་བ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཙུག་ཕུད་དགྱེས་དེ་ལ། །ཁ་ར་དག་དང་སྦྱར་བའི་བཏུང་བ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Priyaprasanna, when a townsman, Offered a sugar drink To the thus-gone Crown of Delight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་ཞལ་ནི་ཕྲེང་རྒྱུད་ཚེ། །བདེ་གཤེགས་ཁ་དོག་ཟིལ་གྱིས་མི་ནོན་ལ། །མེ་ཏོག་ཁལ་བཅུ་དག་གིས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Harivaktra, when a garland maker, Scattered ten bushels of flowers Before the well-gone Indomitable Color And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གཙུག་ཕུད་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གསལ་བ་ལ། །སྤོས་དང་ཨ་མྲའི་འབྲས་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Cūḍa, when a forest guard, Offered incense and mango fruits To the thus-gone Universal Clarity And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྣང་མཛད་སློང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་པའི་རྒྱལ་པོ་ཡི། །བཤོས་དག་བདག་ཉིད་བཙོངས་ཏེ་སྦྱར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Roca, when a beggar, Sold himself to provide food For the thus-gone King of the Array And in doing so first gave rise to the mind of awakening.”

source: སངས་རྒྱས་སྟོང་གི་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཚུལ་རྫོགས་སྷོ།། །།
en: This completes the account of the previous aspirations of the one thousand buddhas.

source: དེ་ལྟར་སངས་རྒྱས་དག་ལ་ཆུང་བ་ཡི། །ཡོན་ཕུལ་རྣམ་པར་སྨིན་པ་འདི་དག་ཡིན། །
en: “Such is the ripening Of small donations made to buddhas.

source: འཁོར་ཚེ་དེ་ཡི་འབྲས་བུ་དེ་འདྲ་ན། །མཁས་པ་སུ་ཞིག་བྱང་ཆུབ་སེམས་མི་སྐྱེད། །
en: Given that the effects in saṃsāra are of this kind, What knowledgeable person would not give rise to the mind of awakening?

source: ནམ་མཁའ་དག་ནི་ཚད་དག་གཟུང་བ་དང་། །རྒྱ་མཚོ་ཆེན་པོ་མཐར་གྱིས་བགྲང་ནུས་ཀྱི། །
en: “It may be possible to comprehend the extent of the sky, And it may be possible to gradually measure the great ocean, Yet

source: སངས་རྒྱས་དག་ལ་དད་པ་ཤས་ཙམ་གྱི། །བསོད་ནམས་ཚད་གཟུང་བར་ནི་ནུས་པར་དཀའ། །
en: it is hard to measure the merit Of even slight faith in the buddhas.

source: ཇི་སྲིད་མྱ་ངན་འདས་བདེ་མ་རེག་པར། །དེ་སྲིད་མི་ཁོམ་སྡུག་བསྔལ་མྱོང་མི་འགྱུར། །
en: “Until reaching the bliss of nirvāṇa, One will not have to suffer the pains of inopportune states.

source: དེ་བས་རྒྱལ་བ་བསོད་ནམས་ཞིང་ཐོབ་ནས། །བག་ཡོད་མི་ཡིས་བཀུར་སྟི་མཆོད་པ་གྱིས། །
en: Therefore, when they have attained the victorious fields of merit, Humans should honor and worship with care.

source: སངས་རྒྱས་དག་ལ་ལྷག་པར་མོས་པའི་ཚེ། །བདེ་གཤེགས་མྱ་ངན་འདས་པའི་སྐུ་གདུང་ལ། །མཆོད་པ་ཆུང་ཤས་བྱེད་པའི་ཡོན་ཏན་མཐའ། །བསམ་པར་ནུས་མ་ཡིན་ན་དེ་ལྟ་ཞོག །
en: “When, deeply inspired by the buddhas, One presents even small offerings before the relics Of the well-gone ones who have attained nirvāṇa, The extent of the associated qualities is impossible to grasp, so keep that in mind!

source: བྱང་ཆུབ་སེམས་ཀྱིས་རྒྱལ་ལ་ཡོན་ཕུལ་དང་། །གང་དག་ཚད་མེད་ཆོས་འདི་བཞི་པོ་དང་། །ནམ་མཁའི་ཁམས་དང་སེམས་ཅན་ཁམས་རྣམས་དག །སྟོན་པ་མ་གཏོགས་ཤེས་པར་ནུས་པ་མེད། །
en: “Offerings to the victorious ones by means of the mind of awakening, These four boundless Dharma teachings, And the realms of space and of sentient beings Can only be understood by the Teacher, and no one else.

source: གང་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་རྗེས་གཟུང་ཕྱིར། །བྱང་ཆུབ་སེམས་བསྐྱེད་གནས་པ་ཇི་ལྟ་བར། །དབུལ་པོས་དཔག་ཚད་ཁོར་ཡུག་གཅིག་ཙམ་གྱི། །གཏེར་དག་རྙེད་པ་དེ་ལྟར་དགའ་མ་ཡིན། །
en: “Compared to giving rise to and correctly abiding by the mind of awakening In order to care for all sentient beings, A poor person’s discovery of a treasure covering an entire league Is not an occasion of happiness.

source: སངས་རྒྱས་བྱང་ཆུབ་ཕྱིར་ནི་རྒྱལ་བ་ཡི། །རྣམ་པར་རོལ་པ་བརྒྱད་དང་སྟོབས་བཅུ་དང་། །སེམས་ཅན་སྡུད་པ་ལྔ་བརྒྱ་དགའ་མཛད་བཞི། །རྟོགས་བྱེད་འཇུག་པ་དག་ནི་བརྒྱད་ཁྲི་དང་། །རྟོགས་པར་དཀའ་བ་བརྒྱད་ཅུ་རྩ་བཞི་དང་། །བླ་ན་མེད་པའི་སྒོ་མོ་དྲུག་ཁྲི་དང་། །ས་རྣམ་འབྱེད་དང་ཡེ་ཤེས་བདུན་ཅུ་དྲུག །སངས་རྒྱས་མཚོན་པ་སྤྱོད་པ་བཅྭ་བརྒྱད་དང་། །ཕ་རོལ་གནོན་པ་ལྔ་དང་བརྟན་པ་བཅུ། །སྤྱོད་ཡུལ་ཐེར་འབུམ་ཕྲག་ནི་བཅུ་གཅིག་དང་། །གཞན་ཡང་སངས་རྒྱས་དག་གི་ཡོན་ཏན་གང་། །མཚན་དང་དཔེ་བྱད་དག་དང་སྤྱོད་ལམ་དག །རང་སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་ལམ་མིན་ན། །ཉན་ཐོས་སྒྲ་རྗེས་འབྲང་བའི་སྨོས་ཅི་དགོས། །
en: “The victorious ones’ eightfold reveling For the sake of awakening, their ten powers, The five hundred congregations of sentient beings, the four delights, The eighty thousand applications of realization, “The eighty-four topics hard to comprehend, The sixty thousand unsurpassable gateways, The discernments of the grounds, the seventy-six forms of wisdom, The eighteen modes of conduct that reveal the buddhas, “The five subjugations of the beyond, the tenfold stability, The eleven billion fields of activity, The qualities of the buddhas, Their marks and signs, and the modes of conduct— “Since none of this is accessible even to solitary buddhas, What need to speak of the hearers who follow the spoken word?

source: མཚུངས་པ་མེད་པ་འདྲ་བ་ཡོད་མིན་པས། །དེས་ན་སངས་རྒྱས་བསམ་མི་ཁྱབ་ཅེས་བརྗོད། །
en: Unparalleled and incomparable, Buddhahood is known to be inconceivable.

source: གང་དག་བྱང་ཆུབ་མཆོག་རབ་སེམས་ཡོད་པ། །དེ་དང་དེ་དག་མི་དམན་མཚུངས་མེད་སྤྱོད། །
en: “Those intent on the highest awakening Are not inferior, and their practice is unparalleled.

source: དེ་དག་དེ་རིང་འཇིག་རྟེན་ནོར་ཆེན་རྙེད། །དེ་དག་འཇིག་རྟེན་ལེགས་པར་འཚོ་བས་འཚོ། །
en: Discovering today the world’s great treasure, They receive fine sustenance in the world.

source: བདུད་རྣམས་བཅོམ་སྟེ་བདུད་རྩི་རེག་བྱས་ནས། །ཆར་སྤྲིན་ལྷུན་སྡུག་ལྟ་བུར་ཚིམ་པར་བྱེད། །
en: “Conquering the māras and reaching the nectar, They are satisfied by majestic rainclouds of beauty.

source: གང་དེ་བྱང་ཆུབ་ལ་ཞུགས་འཇིག་རྟེན་སྐྱོབ། །དེ་དག་ནོར་བདུན་དག་གིས་སྡུད་པར་བྱེད། །
en: Entering awakening, those protectors of the world Gather the seven riches.

source: གལ་ཏེ་སྡུག་བསྔལ་བརྒྱ་མང་བཟོད་བྱེད་པ། །དེ་བས་བྱང་ཆུབ་གང་ཞུགས་སྐྱོ་མི་འགྱུར། །
en: “Bearing hundreds of pains, Those entering awakening will never be weary.

source: དེ་ཡིས་ཡོན་ཏན་དེ་དག་མྱུར་འཐོབ་ལ། །འཇིག་རྟེན་ཀུན་གྱི་མཆོག་མ་དག་ཏུའང་འགྱུར། །
en: Quickly attaining all these qualities, They become the superiors of the entire world.

source: འདོད་པའི་རྒྱུ་ཡིས་སྡུག་བསྔལ་མང་པོ་མྱོང་བར་འགྱུར། །གང་གི་རྣམ་པར་སྨིན་པས་ངན་འགྲོར་ལྷུང་བར་འགྱུར། །
en: “Desires are the cause of numerous sufferings, And as they ripen, beings fall into the lower realms.

source: མཐོ་རིས་འགྲོ་དང་བྱང་ཆུབ་ཡོན་ཏན་དོན་གྱི་ཕྱིར། །མཁས་པ་སུ་ཞིག་བྱིས་པ་དག་དང་འགལ་བར་བྱེད། །
en: As they proceed to the higher realms and accomplish the qualities of awakening, What wise person would commit the breaches of the immature?

source: བྱིས་པ་འགལ་བྱེད་མཁས་པ་འགལ་མི་བྱེད། །
en: “Breaches are made by the immature, not by the wise.

source: མི་ཤེས་འཁྲུལ་ཡིན་ཤེས་ལྡན་དྲན་པ་ཐོབ། །
en: Delusion belongs to the ignorant, while the well-informed achieve recollection.

source: བླུན་པོ་འདམ་བྱིང་མཁས་པ་ཐང་ལ་གནས། །
en: Fools sink in swamps, while the wise reside on plains.

source: གང་དག་ཆོས་སྤྱོད་པ་ནི་དེ་ལ་བཟོད། །
en: Those practicing the Dharma achieve acceptance.

source: དེ་བས་རིགས་པ་ཅན་མིན་སྤང་བྱ་ཞིང་། །གང་དག་ཤེས་ཡུལ་རིགས་ལྡན་བསྟེན་པར་བྱ། །
en: “Therefore, give up the unreasonable And adhere to facts and understanding.

source: དཔལ་དང་གྲགས་པ་རྙེད་པ་སྤངས་ནས་ཀྱང་། །ཏིང་ངེ་འཛིན་འདི་ལ་ནི་རྣལ་འབྱོར་བྱ། །
en: Give up glory, fame, and riches, And engage in the practice of this absorption.

source: སངས་རྒྱས་རེ་རེའི་ཡོན་ཏན་དྲན་པ་ཡང་། །བསྐལ་པ་ཁྲི་ཕྲག་ཚད་མེད་བཟོད་བྱེད་ན། །སངས་རྒྱས་ཡོན་ཏན་བསམ་མེད་སྨོས་ཅི་དགོས། །
en: “Given that recollecting even just a single quality of the buddhas Brings patient endurance of innumerable millennia of eons, What need is there to mention the recollection of buddha qualities that are beyond the reach of thought?

source: དེ་བས་སྡུག་བསྔལ་ཉམ་ཐག་དང་དུ་ལོང་། །
en: Therefore, wholeheartedly accept suffering and misery,

source: བཟོད་དང་ཏིང་འཛིན་དག་གི་གོ་བགོས་ལ། །བརྩོན་འགྲུས་རྒྱལ་མཚན་ཚུལ་ཁྲིམས་ཤིང་རྟ་ཞོན། །
en: “Don the armor of patience and absorption, Raise the banner of diligence, and ride the chariot of discipline.

source: སྦྱིན་སྟོབས་ཤེས་རབ་མདའ་ཡིས་བདུད་བཅོམ་སྟེ། །ཕམ་བྱས་བྱང་ཆུབ་དག་ལ་རེག་པར་གྱིས། །
en: With the arrows of generosity, strength, and insight, Defeat the māras and victoriously proceed to awakening.

source: བྱམས་པའི་གྲོགས་དང་བསྒྲུབ་པའི་བཤེས་གཉེན་དང་། །དབྱེར་མེད་ཕ་རོལ་ཕྱིན་པ་སྤྲོ་བྱེད་དང་། །སྟོང་པའི་གནས་བཅས་ཤུགས་ཀྱི་ཟས་སྟེན་ཚེ། །ཐམས་ཅད་མཁྱེན་པའི་ཡོན་ཏན་ཐོབ་པར་གྱིས། །
en: “Always keeping to the friendship of love and practice, Delight in the perfections, Cherish the home of emptiness, enjoy the food of power, And thus accomplish the qualities of omniscience.

source: དེ་བས་ཇི་སྐད་འདིར་གསུངས་རྣམ་ངེས་ལ། །བག་དང་ལྡན་པས་རྟག་ཏུ་སྦྱོར་བར་གྱིས། །
en: “In this way, comprehend well the teaching that is delivered here And apply yourselves to it with care.

source: མཁའ་ལ་ངང་པ་སྐད་འབྱིན་དགའ་བ་ལྟར། །ཐམས་ཅད་མཁྱེན་པ་མྱུར་དུ་ཐོབ་པར་གྱིས། །
en: Like geese crying with joy as they fly through the sky, Move on quickly into the achievement of omniscience.”

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་མཐའ་ཡས་ཞེས་བྱ་བ་འཁོར་ཐེར་འབུམ་སྙེད་དང་བཅས་པ་ཞིག་བྱུང་བར་གྱུར་ཏེ་དེ་ཏིང་ངེ་འཛིན་འདི་སྟོན་ཏོ། །
en: “Prāmodyarāja, once in the past there was a thus-gone one by the name of Infinite Diligence, whose retinue numbered billions, and he taught this absorption.

source: དེ་ཏིང་ངེ་འཛིན་འདི་སྟོན་པ་ན་དེའི་ཚེ་རྒྱལ་པོ་བསོད་ནམས་མེ་ཏོག་ཅེས་བྱ་བ་ཞིག་བྱུང་བས་ཐོས་ནས། དེས་བཙུན་མོ་སྟོང་དང་སྲས་སྟོང་ལ་སྨྲས་པ།
en: At that time there was a king known as Flower of Merit. The king heard that thus-gone one’s teaching and proceeded to speak as follows to his one thousand queens and one thousand sons:

source: ཏིང་ངེ་འཛིན་ཟད་པར་སྣང་བ་འདིའི་དོན་ཀྱང་མི་ཤེས་སོ། །
en: ‘I do not know the meaning of this exhaustive illumination of absorption.

source: མ་ཤེས་པས་རྟོགས་པར་བྱར་ཡང་མི་ནུས་སོ། །
en: I do not know it, and I fail to understand.

source: དེ་ལྟ་ཡིན་གྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པས་ལེགས་པར་གསུངས་པ་ལ་བདག་ཅག་གིས་རྗེས་སུ་ཡི་རང་བར་ནི་བྱའོ། །
en: Nevertheless, we shall rejoice in these fine statements of the Thus-Gone One.’

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལེགས་པར་གསུངས་ཤིང་བཤད་པའི་ཏིང་ངེ་འཛིན་འདི་ལ་རྗེས་སུ་ཡི་རང་བ་བྱས་པས། དེ་དག་རྗེས་སུ་ཡི་རང་བའི་མོད་ལ་བསྐལ་པ་བརྒྱད་ཁྲིར་འཁོར་བ་བསྙིལ་ནས་དེ་ལས་ཁ་ཕྱིར་ཕྱོགས་པར་གྱུར་ཏོ། །
en: “As the king thus rejoiced in that blessed one’s excellent statements and explanations on this meditative absorption, he cast aside eighty thousand eons of saṃsāra and looked beyond.

source: ཁྱིམ་ཅན་ཞེས་བྱ་བའི་གཟུངས་ཀྱང་ཐོབ་པར་གྱུར་ཏོ། །
en: He attained the recollection called heavenly bodies,

source: བྱང་ཆུབ་ཇི་སྐད་བསྟན་པ་ལ་ཡང་ཐེ་ཚོམ་མེད་པར་གྱུར་ཏོ། །
en: and he indeed became free from doubt with respect to this teaching of awakening.

source: དགེ་བའི་རྩ་བ་དེས་ན་སངས་རྒྱས་སུམ་འབུམ་དག་མཉེས་པར་བྱས་པར་གྱུར་ཏོ། །ཐམས་ཅད་དུ་ཡང་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་གྱུར་ཏོ། །
en: By the roots of virtue ensuing from that, he went on to please three hundred thousand buddhas, and from each of them he received this absorption.

source: ལོག་པར་ལྟུང་བ་དང་། མི་ཁོམ་པ་དག་ཏུ་ནམ་ཡང་ལྟུང་བར་མ་གྱུར་ཏོ། །
en: Never again would he descend into error or inopportune states.

source: རྒྱུ་དེ་ཁོ་ནས་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: By this very cause, he accomplished perfect and complete buddhahood.

source: མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: He became perfectly and completely awakened.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་བསོད་ནམས་མེ་ཏོག་ཅེས་བྱ་བ་དེ་ཁྱོད་ཀྱིས་གཞན་ཡིན་ནོ་སྙམ་པ་དེ་ལྟར་བལྟ་བར་མི་བྱ་སྟེ
en: “Prāmodyarāja, do not think that Flower of Merit, the king at that point and at that time, was someone else.

source: དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་བསོད་ནམས་མེ་ཏོག་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: At that point and at that time, the thus-gone Amitāyus was King Flower of Merit,

source: བསྐལ་པ་བཟང་པོ་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་དེའི་ཚེ་དེའི་དུས་ན་སྲས་སྟོང་དུ་གྱུར་ཏོ། །
en: and the thus-gone ones of this Good Eon were his one thousand sons.

source: དེ་ལྟར་རྗེས་སུ་ཡི་རང་བ་ཙམ་གྱིས་ཀྱང་ཏིང་ངེ་འཛིན་འདི་མཐུ་ཆེ་བ་ཡིན་ན་ཀློག་པ་དང་། ལུང་འབོགས་པ་དང་། བསྒྲུབ་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: If simply rejoicing in this absorption has that much power, what can we say about reading this, receiving its scriptural transmission, and putting it into practice?

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་བདུད་རྩི་དགའ་ཞེས་བྱ་བ་འཁོར་འབུམ་སྙེད་དང་བཅས་པ་ཞིག་བྱུང་བར་གྱུར་ཏེ།
en: “Prāmodyarāja, once in the past there was a thus-gone one by the name of Nectar Joy whose retinue numbered hundreds of thousands.

source: དེ་ལ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བློ་ཡངས་ཞེས་བྱ་བས་ཁང་བཟངས་གསེར་གྱི་འོད་དང་ལྡན་པ་ཙན་དན་དམར་པོའི་ཆུས་བཏབ་པ། ཨ་ག་རུའི་བདུག་པས་བདུགས་པ་ཞིག་ཕུལ་ལོ། །
en: A universal monarch named Vast Mind offered that thus-gone one a palace shining with golden light, moistened by the sap of red sandalwood, and perfumed with the incense of myrobalan.

source: ལོངས་སྤྱད་པའི་ཕྱིར་དགེ་སློང་གི་དགེ་འདུན་ཐམས་ཅད་ལ་ཡང་དེ་ཁོ་ན་དང་འདྲ་བ་ཞིག་ཕུལ་བར་གྱུར་ཏོ། །
en: For their enjoyment, he also offered each member of the saṅgha of monks the exact same gift.

source: དེ་དག་ཐམས་ཅད་ལ་ཡང་སྐྱེད་མོས་ཚལ་རེ་རེ་ཡང་ཕུལ་བར་གྱུར་ཏོ། །དེས་བཅོམ་ལྡན་འདས་དེ་ལས་ཏིང་ངེ་འཛིན་བསྟན་པ་འདི་ཡང་ཐོས་སོ། །
en: Moreover, he offered every one of them a pleasure garden. Thus, he came to hear this absorption from that blessed one.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་ཉིད་ཀྱི་རིམ་གྲོ་པ་མང་དུ་ཐོས་པ་རྣམས་ཀྱི་མཆོག་ཤེས་རབ་རྫོགས་ཞེས་བྱ་བ་ཞིག་བྱུང་བར་གྱུར་པ་དེ་ལ་དེས་འདི་སྐད་དུ།
en: “He then said to the best among the scholars attending that blessed one, someone by the name of Perfect Insight,

source: འདི་ལྟར་བདག་གིས་ཏིང་ངེ་འཛིན་འདི་ཤེས་པར་བྱ་ན་ཁྱིམ་ན་གནས་པས་ནི་འདི་རྟོགས་པར་དཀའ་ཡིས།
en: ‘I must understand this absorption. But doing so is difficult as long as one remains in a household.

source: ཅི་ནས་ཀྱང་བདག་གིས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ལ་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་བར་བྱ་གོར་མ་ཆག་གོ་ཞེས་སྨྲས་སོ། །
en: I must by all means shave off my hair and beard, go forth from the household, and become a homeless mendicant. There can be no doubt about this.’

source: དེ་ནས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས། གོས་ངུར་སྨྲིག་བགོས་ཏེ། ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ནས།
en: He then did shave off his hair and beard, don the saffron-colored robes, go forth from the household, and become a homeless mendicant.

source: སྲས་ཁྲི་དང་། བཙུན་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་ཐམས་ཅད་དང་ལྷན་ཅིག་ཏུ་རབ་ཏུ་བྱུང་སྟེ། ཏིང་ངེ་འཛིན་འདིའི་རྣམ་པ་དག་ཞུས་པ་དང་།
en: All his ten thousand sons and eighty-four thousand queens went forth at the same time, wishing to receive the various aspects of this absorption.

source: བཅོམ་ལྡན་འདས་དེས་དེ་དག་གི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས། ཏིང་ངེ་འཛིན་འདི་ཞག་བདུན་གྱི་བར་དུ་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་ཏོ། །
en: Knowing their thoughts, that blessed one proceeded to teach them this absorption in detail for a period of seven days.

source: དེ་དག་གིས་ཐོས་ནས་ཀྱང་། གཅིག་ལ་གཅིག་འདི་སྐད་དུ།
en: As they heard this teaching, they said to one another,

source: ཀྱེ་མ་ཏིང་ངེ་འཛིན་འདི་མཐོང་བར་དཀའ་མོད་ཀྱི།
en: ‘Alas, this absorption is difficult to behold.

source: འོན་ཀྱང་ཏིང་ངེ་འཛིན་འདི་ལེགས་པར་བྲིས་ཏེ་བཅང་བར་བྱའོ་ཞེས་འཛེར་ཏོ། །
en: Nevertheless, we shall write this down carefully, and we shall uphold this.’

source: དེ་དག་ཐམས་ཅད་ཀྱིས་ཏིང་ངེ་འཛིན་འདི་བྲིས་ནས་ཀྱང་མཆོད་པ་བྱས་སོ། །
en: “Hence, they wrote down this absorption and made it their object of worship.

source: བཟུང་ངོ་། །ལུང་ཡང་ཕོག་གོ། །
en: They retained it and received its transmission.

source: དེ་ནས་དེ་དག་ཐམས་ཅད་དུས་ལས་འདས་ནས། སླར་དེ་དག་ཚོགས་པར་གྱུར་པས་སངས་རྒྱས་དྲུག་འབུམ་མཉེས་པར་བྱས་པར་གྱུར་ཏོ། །
en: After they had passed away, they all came together again, and they pleased six hundred thousand buddhas.

source: ཐམས་ཅད་དུ་ཏིང་ངེ་འཛིན་འདི་ཐོས་པར་གྱུར་ཏོ། །ཐམས་ཅད་རབ་ཏུ་བྱུང་ནས། ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་གྱུར་ཏོ། །
en: They kept hearing this absorption, and they all went forth and obtained this absorption.

source: སྨོན་ལམ་ཇི་ལྟར་བཏབ་པ་བཞིན། དགེ་བའི་རྩ་བ་འདི་ཁོ་ནས་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: In accordance with their prayers and by these roots of virtue alone, they all attained awakening.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བློ་ཡངས་དེ་ཁྱོད་ཀྱིས་གཞན་ཡིན་ནོ་སྙམ་པ་དེ་ལྟར་བལྟ་བར་མི་བྱ་སྟེ།
en: “Prāmodyarāja, do not think that, at that point and at that time, the universal monarch named Vast Mind was someone else.

source: དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེ། དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བློ་ཡངས་ཞེས་བྱ་བར་གྱུར་ཏོ། །དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་དེ་ནི། དགེ་སློང་རིམ་གྲོ་པ་ཤེས་རབ་རྫོགས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: The thus-gone Dīpaṅkara was at that point and on that occasion the universal monarch known as Vast Mind, and the thus-gone Vilocana was the monk and attendant by the name of Perfect Insight.

source: གང་དག་སྲས་ཁྲི་པོ་དེ་དག་ནི་བསྐལ་པ་འདི་ནས་བཟུང་སྟེ། བསྐལ་པ་དྲུག་ཅུ་རྩ་ལྔའི་བར་དུ་འཚང་རྒྱ་བར་མི་འགྱུར་རོ། །
en: His ten thousand sons will remain unable to reach awakening for thirty-five eons, counting from the present one.

source: དེའི་འོག་ཏུ་བསྐལ་པ་གྲགས་པ་ཆེན་པོ་ཞེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ། བསྐལ་པ་གཅིག་པོ་དེ་ལ་དེ་དག་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: Then will follow an eon called Great Renown, and during that single eon all of them will awaken to perfect and complete buddhahood.

source: གང་དག་བློན་པོ་བརྒྱད་ཁྲི་པོ་དེ་དག་ནི། བསྐལ་པ་གྲགས་པ་ཆེན་པོ་འདས་ནས། བསྐལ་པ་བརྒྱད་ཅུའི་བར་དུ་འཚང་རྒྱ་བར་མི་འགྱུར་རོ། །
en: After the eon called Great Renown is over, the eighty thousand ministers will remain unable to reach awakening for eighty eons.

source: དེའི་འོག་ཏུ་བསྐལ་པ་སྐར་མ་ལྟ་བུ་ཞེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ། དེ་ལ་བློན་པོ་བརྒྱད་ཁྲི་པོ་དེ་དག་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: Then will follow an eon called Star-Like, during which those eighty thousand ministers will awaken to perfect and complete buddhahood.

source: བསྐལ་པ་སྐར་མ་ལྟ་བུ་འདས་ནས། བསྐལ་པ་སུམ་བརྒྱ་ནི་སངས་རྒྱས་འབྱུང་བར་མི་འགྱུར་རོ། །
en: After the eon called Star-Like will follow three hundred eons during which no buddhas will appear.

source: དེའི་འོག་ཏུ་བསྐལ་པ་ཡོན་ཏན་བཀོད་པ་ཞེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་རོ། །
en: Then there will be an eon known as Array of Qualities,

source: དེ་ལ་བཙུན་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: and during that time the eighty-four thousand queens will awaken to perfect and complete buddhahood.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་འདི་ནི་དེ་ལྟར་འབྲས་བུ་ཆེ་བ་ཡིན་ནོ། །
en: Prāmodyarāja, such are the fruits born by this absorption of the bodhisattvas.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པ་རྫོགས་པ།
en: “Prāmodyarāja, in this way the superior wishes of the bodhisattvas are fulfilled.

source: ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་གྱུར་པས། ཏིང་ངེ་འཛིན་འདི་བཙལ་བར་བྱའོ། །
en: Without regard for your own body or life, pursue this absorption.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། ཏིང་ངེ་འཛིན་འདི་ལ་རྣལ་འབྱོར་དུ་བྱའོ། །
en: If you wish to awaken to unexcelled and perfect buddhahood, then you should adhere to the practice of this absorption.”

source: སངས་རྒྱས་བྱང་ཆུབ་དོན་དུ་གཉེར་བ་གང་། །དེ་དག་རྒྱལ་པོ་དེ་ཡི་རྗེས་སུ་སློབ། །
en: “Those in pursuit of the buddhas’ awakening Should train in the footsteps of those kings.

source: ཡང་དག་བསྒྲུབ་ལ་གནས་པ་མ་གཏོགས་པར། །གཞན་གྱིས་བྱང་ཆུབ་མཆོག་ནི་འཐོབ་མི་འགྱུར། །
en: For, besides adhering to true practice, There is no way to achieve supreme awakening.

source: དེ་ལྟར་འདིར་ནི་དད་པ་ཆུང་བསྐྱེད་ཀྱང་། །དེ་བཞིན་རྣམ་སྨིན་གྱ་ནོམ་འཐོབ་པར་འགྱུར། །
en: “Even if one’s faith in this is weak, The ripening achieved will be sublime.

source: དེ་བས་གཡོ་མེད་ལྷག་པའི་བསམ་པ་ཡིས། །འདིར་ནི་ཅི་རིགས་བཀུར་སྟིས་རྣལ་འབྱོར་གྱིས། །
en: Therefore, with unswerving, superior intent, Engage in this spiritual practice with all manner of respect.

source: རྒྱལ་བ་གང་དེ་བདག་གིས་འདིར་བསྒྲགས་པ། །དེ་དག་གང་ཞིག་མཐོང་བར་འདོད་པ་དང་། །བསྟན་པ་རྒྱ་ཆེར་འཆད་པར་འདོད་པ་དག །ཇི་སྐད་བསྟན་བཞིན་འདི་ལ་རྣལ་འབྱོར་གྱིས། །
en: “Those who wish to see the victors Of whom I have here spoken, And who wish for extensive explanation, Should, just as taught, take up this spiritual practice.

source: ཡི་རང་ཉིད་ཀྱིས་ཕུན་སུམ་ཚོགས་འགྱུར་ན། །འཆང་དང་ཀློག་པ་ལྟ་ཞིག་ཅི་སྨོས་ཏེ། །
en: “Since merely rejoicing brings such excellence, What need is there to mention the effects of holding and reading this?

source: ཡོན་ཏན་མཐའ་ནི་འགྲོ་བས་བསམ་མི་ནུས། །
en: No wandering being can conceive of the extent of these qualities.

source: འདི་ཐོས་སུ་ཞིག་རྣལ་འབྱོར་སྦྱོར་མི་བྱེད། །
en: Upon hearing this, who would not engage in this spiritual practice?

source: བྱང་ཆུབ་སོ་སོ་ཡང་དག་རིག་མཚན་དང་། །སྟོན་དང་ཕ་རོལ་སེམས་ནི་གླེང་བ་དང་། །སྒྲུབ་དང་སྣང་བ་གང་དག་སངས་རྒྱས་ཆོས། །ཏིང་ངེ་འཛིན་འདི་ལས་ནི་བཙལ་བར་བྱ། །
en: “Awakening, correct knowledge, distinctive features, Teaching, inspiring the minds of others, Practice, and illumination—all these buddha qualities Should be pursued through this absorption.

source: ལས་སྦྱོང་དེ་བཞིན་བདུད་རྣམས་འཇོམས་པ་དང་། །ལྟ་སྦྱོང་དེ་བཞིན་སྲིད་པ་ཟད་བྱེད་དང་། །རྣམ་པར་རོལ་དང་ཞིང་བཀོད་འབྱོར་པ་དག །འདི་དང་རབ་ཏུ་ལྡན་ལ་དཀོན་མ་ཡིན། །
en: “Purification of karma, defeating the māras, Purifying beliefs, bringing existence to the point of exhaustion, Reveling, and the rich arrays of the pure fields— None of these are rare for the one who is in possession of this.

source: དེ་བཞིན་རྣམ་གྲོལ་སྤོབས་པ་ཕུན་ཚོགས་དང་། །བྱ་བ་ཐམས་ཅད་སྦྱོང་བྱེད་གཟུགས་དག་དང་། །བསམ་པ་ཇི་བཞིན་བྱང་ཆུབ་འཚང་རྒྱ་བ། །དེ་དག་ཐམས་ཅད་འདིར་གནས་མོད་པ་ཡིན། །
en: “Likewise, liberation, perfect acumen, Universal mastery of actions, Bodies suited to one’s wishes, and awakening to buddhahood— All of these are abundant for the one who abides by this.

source: ང་ཡིས་དེ་སྙེད་ཚིག་གིས་རྗོད་ནུས་རྣམས། །དེ་ལྟ་བས་ན་དེ་དག་འདིར་སྒྲུབས་ཤིག །
en: “As I have spoken here of these matters in abundant words, Do follow them up here and accomplish them!

source: ཀུན་མཁྱེན་ཆོས་ལ་དགའ་བར་མ་བྱས་ན། །ཕྱི་དུས་དག་ན་འགྱོད་པར་གྱུར་ཏ་རེ། །
en: Those who do not delight in the qualities of omniscience Will surely have regrets in the future.

source: ཕ་རོལ་ཕྱིན་པ་ཇི་སྙེད་ངས་བསྟན་དང་། །གང་དག་ཡེ་ཤེས་རྒྱ་མཚོ་སྦྱོར་ལམ་དག །ལུས་རྟེན་བྱིས་པའི་སྤྱོད་ལ་གནས་པ་ཡིས། །ཤེས་པར་བྱ་བ་དག་ཏུ་ནུས་མ་ཡིན། །
en: “The many perfections I have taught, Along with the paths for reaching the ocean of wisdom, Remain beyond the scope of comprehension Of corporeal beings engaged in infantile conduct.

source: དུས་ངན་པ་དང་སེམས་ཅན་མ་རུངས་དང་། །ཆོས་ནུབ་མཐའ་དང་ངན་སོང་འཕེལ་བ་ན། །
en: “In evil times when beings are wicked, When the Dharma is about to disappear and the lower realms are looming,

source: མཁས་པས་ཤིན་ཏུ་ཡིད་བྱུང་བྱས་ནས་ཀྱང་། །བག་ཡོད་རི་དགས་བཞིན་དུ་སྐྲག་པར་འགྱུར། །
en: The wise will feel deep remorse. They will be cautious and timid, like deer.
